Repository: paulmooreparks/Api2Cli
Catalog: a2c/Resources/Messages.*.resx
Languages: ms, ta, zh_hans

# script.notFound
source: ✖ Script '{script}' not found.
ms: ✖ Skrip '{script}' tidak ditemui.
ta: ✖ ஸ்கிரிப்ட் '{script}' கிடைக்கவில்லை.
zh_hans: ✖ 未找到脚本“{script}”。

# workspace.notFound
source: ✖ Workspace '{workspace}' not found.
ms: ✖ Ruang kerja '{workspace}' tidak ditemui.
ta: ✖ வேலைவெளி '{workspace}' கிடைக்கவில்லை.
zh_hans: ✖ 未找到工作区“{workspace}”。

# script.missingName
source: ✖ Script name is required.
ms: ✖ Nama skrip diperlukan.
ta: ✖ ஸ்கிரிப்ட் பெயர் அவசியம்.
zh_hans: ✖ 需要脚本名称。

# arg.convert.failure
source: ✖ Argument conversion failed for value '{value}' → {targetType}
ms: ✖ Penukaran argumen gagal bagi nilai '{value}' → {targetType}
ta: ✖ '{value}' மதிப்பை {targetType} ஆக மாற்றும்போது தோல்வி.
zh_hans: ✖ 参数值“{value}”转换为 {targetType} 失败

# arg.array.convert.failure
source: ✖ Array argument conversion failed for '{value}' (element type {elemType})
ms: ✖ Penukaran argumen tatasusunan '{value}' gagal (jenis elemen {elemType})
ta: ✖ வரிசை argument '{value}' மாற்றம் தோல்வி (உறுப்பின் வகை {elemType})
zh_hans: ✖ 数组参数“{value}”转换失败 (元素类型 {elemType})

# workspace.definition.missing
source: ✖ Script definition not found.
ms: ✖ Definisi skrip tidak ditemui.
ta: ✖ ஸ்கிரிப்ட் வரையறை கிடைக்கவில்லை.
zh_hans: ✖ 未找到脚本定义。

# request.notFound
source: ✖ Request '{request}' not found in current workspace.
ms: ✖ Permintaan '{request}' tidak ditemui dalam ruang kerja semasa.
ta: ✖ தற்போதைய வேலைவெளியில் '{request}' கோரிக்கை கிடைக்கவில்லை.
zh_hans: ✖ 当前工作区中未找到请求“{request}”。

# prerequest.failure
source: ✖ Error executing preRequest script: {message}
ms: ✖ Ralat melaksanakan skrip pra-permintaan: {message}
ta: ✖ preRequest ஸ்கிரிப்ட் இயங்கும்போது பிழை: {message}
zh_hans: ✖ 预请求脚本执行出错: {message}

# get.missing
source: ✖ Error: Unable to find GET command.
ms: ✖ Ralat: Perintah GET tidak ditemui.
ta: ✖ பிழை: GET கட்டளை கிடைக்கவில்லை.
zh_hans: ✖ 错误：找不到 GET 命令。

# postresponse.failure
source: ✖ Error executing postResponse script: {message}
ms: ✖ Ralat melaksanakan skrip pasca-respons: {message}
ta: ✖ postResponse ஸ்கிரிப்ட் இயங்கும்போது பிழை: {message}
zh_hans: ✖ 响应后脚本执行出错: {message}

# post.missing
source: ✖ Error: Unable to find POST command.
ms: ✖ Ralat: Perintah POST tidak ditemui.
ta: ✖ பிழை: POST கட்டளை கிடைக்கவில்லை.
zh_hans: ✖ 错误：找不到 POST 命令。

# method.unknown
source: ✖ Unknown method {method}
ms: ✖ Kaedah tidak diketahui {method}
ta: ✖ தெரியாத முறை {method}
zh_hans: ✖ 未知方法 {method}

# script.invoke.callScript.error
source: ✖ Script '{script}' failed: {message}
ms: ✖ Skrip '{script}' gagal: {message}
ta: ✖ ஸ்கிரிப்ட் '{script}' தோல்வி: {message}
zh_hans: ✖ 脚本“{script}”失败: {message}

# script.invoke.unhandled
source: ✖ Script '{script}' failed: {message}
ms: ✖ Skrip '{script}' gagal: {message}
ta: ✖ ஸ்கிரிப்ட் '{script}' தோல்வி: {message}
zh_hans: ✖ 脚本“{script}”失败: {message}

# arg.convert.failure.detail
source: ✖ Argument conversion failed for value '{value}' → {targetType}: {message}
ms: ✖ Penukaran argumen gagal bagi nilai '{value}' → {targetType}: {message}
ta: ✖ '{value}' மதிப்பை {targetType} ஆக மாற்றும்போது தோல்வி: {message}
zh_hans: ✖ 参数转换失败: {message}

# arg.array.convert.failure.detail
source: ✖ Array argument conversion failed: {message}
ms: ✖ Penukaran argumen tatasusunan gagal: {message}
ta: ✖ வரிசை argument மாற்றம் தோல்வி: {message}
zh_hans: ✖ 数组参数转换失败: {message}

# script.error
source: ✖ Error executing script: {message}
ms: ✖ Ralat melaksanakan skrip: {message}
ta: ✖ ஸ்கிரிப்ட் இயக்கப் பிழை: {message}
zh_hans: ✖ 脚本执行出错: {message}

# baseurl.invalid
source: ✖ Error: Invalid base URL: {baseUrl}
ms: ✖ Ralat: URL asas tidak sah: {baseUrl}
ta: ✖ பிழை: தவறான அடிப்படை URL: {baseUrl}
zh_hans: ✖ 错误：无效的基础 URL: {baseUrl}

# reload.failure
source: ✖ Reload failed: {message}
ms: ✖ Muat semula gagal: {message}
ta: ✖ மீளேற்றம் தோல்வி: {message}
zh_hans: ✖ 重新加载失败: {message}

# reload.success
source: Configuration reloaded (scripting reset).
ms: Konfigurasi dimuat semula (scripting ditetapkan semula).
ta: உள்ளமைவு மீளேற்றப்பட்டது (ஸ்கிரிப்டிங் மீளமைக்கப்பட்டது).
zh_hans: 配置已重新加载（脚本已重置）。

# import.success
source: Workspace imported to {file} with {count} requests.
ms: Ruang kerja diimport ke {file} dengan {count} permintaan.
ta: வேலைவெளி {file} க்கு இறக்குமதி செய்யப்பட்டது; {count} கோரிக்கைகள்.
zh_hans: 工作区已导入到 {file}，包含 {count} 个请求。

# import.guidance.header
source: Add this line inside the workspaces block of your config.xfer to activate it:
ms: Tambah baris ini dalam blok workspaces dalam config.xfer anda untuk mengaktifkannya:
ta: இதை செயலில் கொண்டு வர உங்கள் config.xfer இல் workspaces பகுதியில் இந்த வரியை சேர்க்கவும்:
zh_hans: 在 config.xfer 的 workspaces 块中添加此行以激活：

# import.guidance.reload
source: Then run: reload
ms: Kemudian jalankan: reload
ta: பின்னர் இயக்கவும்: reload
zh_hans: 然后运行: reload

# import.dir.exists
source: ✖ Directory already contains a workspace.xfer: {file}. Use --force to overwrite.
ms: ✖ Direktori sudah mengandungi workspace.xfer: {file}. Guna --force untuk menulis ganti.
ta: ✖ அடைவில் ஏற்கனவே workspace.xfer உள்ளது: {file}. --force பயன்படுத்தி எழுதி மேலெழுதவும்.
zh_hans: ✖ 目录已包含 workspace.xfer: {file}。使用 --force 覆盖。

# import.failure
source: ✖ Import failed: {message}
ms: ✖ Import gagal: {message}
ta: ✖ இறக்குமதி தோல்வி: {message}
zh_hans: ✖ 导入失败: {message}

# import.jsonParse.failure
source: ✖ Failed to parse OpenAPI JSON: {message}
ms: ✖ Gagal menghuraikan OpenAPI JSON: {message}
ta: ✖ OpenAPI JSON பகுப்பாய்வு தோல்வி: {message}
zh_hans: ✖ 解析 OpenAPI JSON 失败: {message}

# http.fetch.failure
source: ✖ GET {url} failed: {message}
ms: ✖ GET {url} gagal: {message}
ta: ✖ GET {url} தோல்வி: {message}
zh_hans: ✖ GET {url} 失败: {message}

# package.list.header
source: Installed Plugins:
ms: Plugin Dipasang:
ta: நிறுவப்பட்ட பிளகின்கள்:
zh_hans: 已安装的插件:

# package.list.empty
source: ⚠ No plugins installed.
ms: ⚠ Tiada plugin dipasang.
ta: ⚠ எந்த பிளகின்களும் நிறுவப்படவில்லை.
zh_hans: ⚠ 未安装任何插件。

# store.clear.confirm
source: Are you sure you want to clear all keys from the store?
ms: Adakah anda pasti mahu mengosongkan semua kunci daripada stor?
ta: சேமிப்பகத்திலிருந்து அனைத்து விசைகளையும் நீக்க விரும்புகிறீர்களா?
zh_hans: 确定要清空存储中的所有键吗？

# store.clear.cancelled
source: Operation cancelled.
ms: Operasi dibatalkan.
ta: செயல் ரத்து செய்யப்பட்டது.
zh_hans: 操作已取消。

# store.clear.success
source: Store cleared.
ms: Stor dikosongkan.
ta: சேமிப்பகம் காலியிடப்பட்டது.
zh_hans: 存储已清空。

# store.get.key.notFound
source: ✖ Key '{key}' not found.
ms: ✖ Kunci '{key}' tidak ditemui.
ta: ✖ '{key}' விசை கிடைக்கவில்லை.
zh_hans: ✖ 未找到键“{key}”。

# foo.executed
source: Foo command executed.
ms: Perintah Foo dilaksanakan.
ta: Foo கட்டளை இயங்கியது.
zh_hans: Foo 命令已执行。

# script.console.emptyTable
source: (empty table)
ms: (jadual kosong)
ta: (காலியான அட்டவணை)
zh_hans: (空表)

# script.console.noProperties
source: (No properties found)
ms: (Tiada sifat ditemui)
ta: (பண்புகள் எதுவும் இல்லை)
zh_hans: (未找到属性)

# script.console.maxDepth
source: [ERROR] Maximum recursion depth reached.
ms: [RALAT] Kedalaman rekursi maksimum dicapai.
ta: [பிழை] அதிகபட்ச recursion ஆழம் சென்றடைந்தது.
zh_hans: [错误] 已达到最大递归深度。

# import.missingSource
source: ✖ Please specify a source URL or file path (positional) or use --openapi.
ms: ✖ Sila nyatakan URL sumber atau laluan fail (posisi) atau guna --openapi.
ta: ✖ ஒரு மூல URL அல்லது கோப்பு பாதையை (positional) குறிப்பிடுங்கள் அல்லது --openapi பயன்படுத்துங்கள்.
zh_hans: ✖ 请指定源 URL 或文件路径（位置参数）或使用 --openapi。

# import.yamlUnsupported
source: ✖ YAML OpenAPI specs are not yet supported. Please supply a JSON spec.
ms: ✖ Spesifikasi OpenAPI YAML belum disokong. Sila berikan spesifikasi JSON.
ta: ✖ YAML OpenAPI விளக்கங்கள் இதுவரை ஆதரிக்கப்படவில்லை. தயவு செய்து JSON விளக்கத்தை வழங்கவும்.
zh_hans: ✖ 暂不支持 YAML OpenAPI 规范，请提供 JSON 规范。

# import.missingPaths
source: ✖ Invalid OpenAPI document: missing 'paths'.
ms: ✖ Dokumen OpenAPI tidak sah: tiada 'paths'.
ta: ✖ தவறான OpenAPI ஆவணம்: 'paths' இல்லை.
zh_hans: ✖ 无效的 OpenAPI 文档：缺少 'paths'。
